performance.yml
---
execution:
- concurrency: 10
  ramp-up: 1s
  hold-for: 1s
  scenario: simple

scenarios:
  simple:
    script: src/test/groovy/web/tests
    additional-classpath:
    - target/example-groovy-1.0-SNAPSHOT.jar

reporting:
- module: junit-xml
  filename: performance.xml
  data-source: pass-fail

modules:
  console:
    disable: true