performance.yml
---
execution:
- concurrency: 10
  ramp-up: 1s
  hold-for: 1s
  scenario: simple

scenarios:
  simple:
    script: src/test/groovy/web/tests
    additional-classpath:
    - target/example-groovy-1.0-SNAPSHOT.jar

services:
- module: passfail
  criteria:
  - subject: avg-rt  # required
    label: 'Average response rate'  # optional, default is ''
    condition: '>'  # required
    threshold: 150ms  # required
    timeframe: 5s  # optional, default is none

reporting:
- module: junit-xml
  filename: performance.xml
  data-source: pass-fail

modules:
  console:
    disable: true